tests/transactions/payment_with_third_party_iou.json

rD7khdZL58PyhujLwM1Kx7yHBmoxPJ7vPw is the Payer
rPLPhxxHdKrgyHdpCDfnEqPXMCLhztAWDD is the Payee
rvYAfWj5gh67oV6fW32ZzP3Aw4Eubs59B is Bitstamp, their IOUs are being sent

------

{
   "SigningPubKey":"03483E117CDA30BB9B37F255ECF40A18F28337E83F7718FF120F11F663564DEC9D",
   "TransactionType":"Payment",
   "Account":"rD7khdZL58PyhujLwM1Kx7yHBmoxPJ7vPw",
   "SendMax":{
      "currency":"USD",
      "issuer":"rD7khdZL58PyhujLwM1Kx7yHBmoxPJ7vPw",
      "value":"1.01202"
   },
   "Amount":{
      "currency":"USD",
      "issuer":"rPLPhxxHdKrgyHdpCDfnEqPXMCLhztAWDD",
      "value":"1"
   },
   "DestinationTag":1254122299,
   "Sequence":47,
   "TxnSignature":"304402207450314DD6F7C2CFC30EF19B42B05695A240BC4E9CB8C96AB75EDC21DE44EE5C02206C86A3F0AAC3400631D25BF43547F2F63EE73D471D71C53827E7DCB1ECE7827D",
   "Paths":[
      [
         {
            "account":"rvYAfWj5gh67oV6fW32ZzP3Aw4Eubs59B",
            "type":1,
            "type_hex":"0000000000000001"
         }
      ]
   ],
   "hash":"489A50F9E28304225B1ED5658B232F91A2DA683CE1EE39A339C94A5D01345062",
   "Destination":"rPLPhxxHdKrgyHdpCDfnEqPXMCLhztAWDD",
   "metaData":{
      "AffectedNodes":[
         {
            "ModifiedNode":{
               "PreviousTxnID":"9A54E63E14CFF3FD5797E4950DF212966B89949BCDF26DCE3F94B99082D72376",
               "FinalFields":{
                  "LowLimit":{
                     "currency":"USD",
                     "issuer":"rvYAfWj5gh67oV6fW32ZzP3Aw4Eubs59B",
                     "value":"0"
                  },
                  "Flags":131072,
                  "Balance":{
                     "currency":"USD",
                     "issuer":"rrrrrrrrrrrrrrrrrrrrBZbvji",
                     "value":"-54.4127306360021"
                  },
                  "HighNode":"0000000000000000",
                  "LowNode":"00000000000000AC",
                  "HighLimit":{
                     "currency":"USD",
                     "issuer":"rD7khdZL58PyhujLwM1Kx7yHBmoxPJ7vPw",
                     "value":"400"
                  }
               },
               "PreviousFields":{
                  "Balance":{
                     "currency":"USD",
                     "issuer":"rrrrrrrrrrrrrrrrrrrrBZbvji",
                     "value":"-55.4147306360021"
                  }
               },
               "LedgerIndex":"1CC8E54389FEBA0A68161275B2C038FBB2E5E5EDF519932C8F7DEDB312A686EE",
               "LedgerEntryType":"RippleState",
               "PreviousTxnLgrSeq":4279703
            }
         },
         {
            "ModifiedNode":{
               "PreviousTxnID":"9A54E63E14CFF3FD5797E4950DF212966B89949BCDF26DCE3F94B99082D72376",
               "FinalFields":{
                  "Sequence":48,
                  "Account":"rD7khdZL58PyhujLwM1Kx7yHBmoxPJ7vPw",
                  "Flags":0,
                  "Balance":"16130787821",
                  "OwnerCount":5
               },
               "PreviousFields":{
                  "Sequence":47,
                  "Balance":"16130787835"
               },
               "LedgerIndex":"CCE2D80C6762BA3591AB7F16DEB819CDF30EA1D1F28ED0DB486F75F2E09AE390",
               "LedgerEntryType":"AccountRoot",
               "PreviousTxnLgrSeq":4279703
            }
         },
         {
            "ModifiedNode":{
               "PreviousTxnID":"9A54E63E14CFF3FD5797E4950DF212966B89949BCDF26DCE3F94B99082D72376",
               "FinalFields":{
                  "LowLimit":{
                     "currency":"USD",
                     "issuer":"rvYAfWj5gh67oV6fW32ZzP3Aw4Eubs59B",
                     "value":"0"
                  },
                  "Flags":2228224,
                  "Balance":{
                     "currency":"USD",
                     "issuer":"rrrrrrrrrrrrrrrrrrrrBZbvji",
                     "value":"-28"
                  },
                  "HighNode":"0000000000000000",
                  "LowNode":"0000000000000145",
                  "HighLimit":{
                     "currency":"USD",
                     "issuer":"rPLPhxxHdKrgyHdpCDfnEqPXMCLhztAWDD",
                     "value":"500"
                  }
               },
               "PreviousFields":{
                  "Balance":{
                     "currency":"USD",
                     "issuer":"rrrrrrrrrrrrrrrrrrrrBZbvji",
                     "value":"-27"
                  }
               },
               "LedgerIndex":"D80E0B5901CB4CE8201B28F817E4075A5321A870B440863F17AC9A03A88CE2E3",
               "LedgerEntryType":"RippleState",
               "PreviousTxnLgrSeq":4279703
            }
         }
      ],
      "TransactionResult":"tesSUCCESS",
      "TransactionIndex":0
   },
   "Fee":"14",
   "Flags":0
}
